package view;

import controller.StudentController;

public class ConsoleViewer {

    public void start(){
        StudentController studentController = new StudentController();
        String inputText = "Рижова Євгенія Вікторівна\n" +
                "Чупрасов Максим Олександрович\n" +
                "Коцуренко Артем Андрійович\n" +
                "Романько Єгор Андрійович\n" +
                "Гіль Яна Романівна\n" +
                "Випова Карина Олексіївна\n" +
                "Мелешко Злата Андріївна\n" +
                "Кобцева Олександра Романівна\n" +
                "Полтавець Лілія Олексіївна\n" +
                "Даниловська Карина Ярославівна\n" +
                "Клименок Дмитро Олександрович\n" +
                "Коць Владислав Сергійович\n" +
                "Строкоус Ілля Анатолійович\n" +
                "Гонташ Денис Віталійович\n" +
                "Нападовський Владислав Павлович\n" +
                "Штріккер Артем Констянтинович\n" +
                "Кучинський Артем Андрійович\n" +
                "Іващук Віталій Валентинович\n" +
                "Поліщук Ярослав Миколайович\n" +
                "Малітен Роман Вікторович\n" +
                "Таран Максим Геннадійович\n" +
                "Дучак Артем Олександрович\n" +
                "Степаненко Ярослав Віталійович\n" +
                "Шепель Данило Володимирович\n" +
                "Князько Ярослав Сергійович\n" +
                "Кравченко Георгій Андрійович\n" +
                "Рощак Тимур Артемович\n" +
                "Фармагей Назар Анатолійович\n" +
                "Пастушенко Руслан Олександрович\n" +
                "Тарасюк Роман Андрійович\n" +
                "Самофал Денис Сергійович\n" +
                "Маханов Владислав Артемович\n" +
                "Бойко Олександр Олексндрович\n";


        studentController.addStudent(inputText);
        studentController.getAllStudents();
        System.out.println("-".repeat(50));
        studentController.sort();
        studentController.getAllStudents();
    }
}
